Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/reference/case_studies/case_study_2_how_income_from_employment_affects_your_jobseeker_s_allowance.html.txt.tmx
Source language: en
Languages: ga

source: Case study 2: How income from employment affects your Jobseeker's Allowance
ga: Cás-staidéar 2: Conas a bhíonn tionchar ag ioncam ó fhostaíocht in Éirinn ar an Liúntas do Lucht Cuardaigh Fostaíochta

source: This case study shows the affect of work on Jobseeker's Allowance in 2017
ga: Léiríonn an cás-staidéar seo an tionchar a bhíonn ag obair ar an Liúntas do Lucht Cuardaigh Fostaíochta in 2017

source: Frank is living with his partner Joanne and their two children
ga: Tá Frank ina chónaí lena pháirtí Joanne agus lena mbeirt leanaí

source: He recently lost his job and has applied for Jobseeker's Allowance
ga: Chaill sé a phost le gairid agus tá iarratas déanta aige ar Liúntas do Lucht Cuardaigh Fostaíochta

source: He has some temporary work driving a minibus for a local disability service every Saturday and Sunday
ga: Tá obair shealadach aige ag tiomáint mionbhus do sheirbhís áitiúil do dhaoine faoi mhíchumas gach Satharn agus Domhnach

source: His assessable average weekly earnings are €140
ga: Tá a thuilleamh seachtainiúil inmheasúnaithe cothrom le €140

source: Joanne is working part-time for 3 days a week and earns €85 per week
ga: Tá Joanne ag obair go páirtaimseartha trí lá sa tseachtain agus tuileann sí €85 in aghaidh na seachtaine

source: She is also getting Child Benefit for the two children
ga: Faigheann sí Sochar Leanaí don bheirt leanaí chomh maith

source: They recently sold their old family home and bought a newer house
ga: Dhíol siad seanteach an teaghlaigh le déanaí agus cheannaigh siad teach níos nuaí

source: They made a profit of €15,000 on the sale of their house and have an additional €5,000 savings
ga: Rinne siad brabús €15,000 ar dhíol an tí agus tá coigilteas breise €5,000 acu

source: First calculate Frank and Joanne's means
ga: Ar dtús ríomh acmhainní Frank agus Joanne

source: Frank's assessable income from employment €60
ga: Ioncam inmheasúnaithe Frank ó fhostaíocht €60

source: Joanne's assessable income from employment €15
ga: Ioncam inmheasúnaithe Joanne ó fhostaíocht €15

source: Means assessed from savings 0
ga: Acmhainní measúnaithe ó choigilteas 0

source: Calculate Frank's maximum rate of Jobseeker's Allowance
ga: Ríomh uasráta an Liúntais do Lucht Cuardaigh Fostaíochta atá ag Frank

source: This includes the maximum personal rate and any increase for a qualified adult
ga: Cuimsíonn sé seo an t-uasráta pearsanta agus aon mhéadú le aghaidh duine aosaithe cháilithe

source: Jobseeker's Allowance rate (from March 2017) €193
ga: Ráta an Liúntais do Lucht Cuardaigh Fostaíochta (ó Márta 2017) €193

source: Add increase for a qualified adult €128.10
ga: Móide méadú le haghaidh duine aosaithe cháilithe €128.10

source: Add increase for child dependents €59.60
ga: Móide méadú do leanaí cleithiúnacha €59.60

source: Maximum rate of Jobseeker's Allowance less assessable means
ga: Uasráta an Liúntais do Lucht Cuardaigh Fostaíochta lúide acmhainní inmheasúnaithe

source: Maximum rate of Jobseeker's Allowance €380.70
ga: Uasráta an Liúntais do Lucht Cuardaigh Fostaíochta €380.70

source: Less assessable means €75
ga: Lúide acmhainní inmheasúnaithe €75

source: (JA personal rate plus increase for a qualified adult)
ga: (Ráta pearsanta LLCF móide méadú le haghaidh duine aosaithe cháilithe)

source: Total Jobseeker's Allowance rate payable to Frank €305.70
ga: Iomlán Ráta an Liúntais do Lucht Cuardaigh Fostaíochta atá iníoctha le Frank €305.70

source: Firstly, assess Frank's income from work using the following formula:
ga: Ar dtús, déan ioncam Frank ón obair a mheasúnú agus úsáid á baint as an bhfoirmle seo a leanas:

source: €20 per day from casual work (up to a maximum of €60) will be deducted from his average assessable weekly earnings and then 60% of the balance will be assessed as his weekly means
ga: Déanfar €20 in aghaidh an lae ó obair ócáideach (suas le huasmhéid de €60) a bhaint as a mheántuilleamh inmheasúnaithe seachtainiúil, agus ansin déanfar 60% den fhuílleach a mheasúnú mar a acmhainní seachtainiúla

source: €140 - €40 (2 days work) = €100 x 60% = €60
ga: €140 - €40 (don dá lá a oibríodh) = €100 x 60% = €60

source: The following allowances are always deducted from your gross earnings to get your assessable earnings:
ga: Déantar na lamháltais a leanas a asbhaint ó d’olltuilleamh i gcónaí chun do thuilleamh inmheasúnaithe a fháil:

source: • PRSA (Personal Retirement Savings Account
ga: • CCSP (Cuntas Coigiltis Scoir Pearsanta)

source: Frank's weekly means from employment of €60 is less than the maximum amount he would be entitled to for his circumstances (€380.70)
ga: Tá acmhainní seachtainiúla Frank ó fhostaíocht arb ionann iad agus €60 níos lú ná an t-uasmhéid a bheadh sé i dteideal a fháil ó thaobh a imthosca (€380.70)

source: Because we now know he is entitled to a certain amount of Jobseeker's Allowance the next step is to calculate the actual amount of Jobseeker's Allowance he is entitled to
ga: Toisc go bhfuil a fhios againn anois go bhfuil sé i dteideal méid áirithe dá Liúntas do Lucht Cuardaigh Fostaíochta a choinneáil is é an chéad chéim eile ná méid iarbhír an Liúntais do Lucht Cuardaigh Fostaíochta a bhfuil sé i dteideal a fháil a ríomh

source: To do this you must calculate his 'assessable daily earnings'
ga: Caithfidh tú a ‘thuilleamh inmheasúnaithe laethúil’ a ríomh chun é seo a dhéanamh

source: He is entitled to JA only for periods of unemployment
ga: Níl sé i dteideal an LLCF a fháil ach do thréimhsí dífhostaíochta amháin

source: The minimum period a person must be unemployed in order to receive JA is 4 days in a period of 7 consecutive days
ga: Is é an íostréimhse go gcaithfidh duine a bheith dífhostaithe chun LLCF a fháil ná 4 lá i dtréimhse 7 lá as a chéile

source: Frank has 5 consecutive days of unemployment
ga: Tá cúig lá dífhostaíochta as a chéile ag Frank

source: He is employed for 2 days out of 7
ga: Tá sé fostaithe 2 lá as 7 lá

source: Frank's average assessable daily earnings are €140
ga: Is ionann meántuilleamh inmheasúnaithe laethúil Frank agus (€140)

source: Less disregard for days worked €140 - €40 = €100 (No disregard for Sunday)
ga: Lúideneamhaird don lá a oibríodh €140 - €40 = €100

source: 60 % of his assessable daily earnings of €100= €60
ga: 60 % dá thuilleamh laethúil inmheasúnaithe de €100= €60

source: Frank's assessable income from employment is €60
ga: Tá Ioncam inmheasúnaithe Frank ó fhostaíocht cothrom le €60

source: Joanne's income from employment is €85
ga: Is é an t-ioncam ó fhostaíocht a fhaigheann Joanne ná €85

source: €20 per day from casual work (up to a maximum of €60) will be deducted from her average assessable weekly earnings and then 60% of the balance will be assessed as her weekly means
ga: Déanfar €20 in aghaidh an lae ó obair ócáideach (suas le huasmhéid de €60) a asbhaint óna meántuilleamh inmheasúnaithe seachtainiúil, agus ansin déanfar 60% den fhuílleach a mheasúnú mar a hacmhainní seachtainiúla

source: €85 - €60 (3 days worked) = €25 x 60% = €15
ga: €110 – €60 (don 3 lá a oibríodh) = €25 x 60% = €15

source: Child Benefit is not taken into account in the assessment of means
ga: Ní chuirtear Sochar Leanaí san áireamh nuair atá acmhainní á ríomh

source: More information can be found in our document How Jobseeker's Allowance is affected by income from employment and in our Worksheet on Jobseeker's Allowance and income from work
ga: Is féidir tuilleadh eolais a fháil inár ndoiciméad Conas atá tionchar ag ioncam fostaíochta ar Liúntas do Lucht Cuardaigh Fostaíochta agus inár mBileog oibre ar Liúntas do Lucht Cuardaigh Fostaíochta agus ioncam ón obair

source: Joanne and Frank have combined savings of €20,000
ga: Tá coigilteas €20,000 ag Joanne agus Frank in éineacht

source: This is below the €20,000 threshold and is not taken into account as means
ga: Tá sé sin faoin tairseach €20,000 agus ní chuirtear san áireamh mar acmhainní é
